import VitrazhPage from "@/app/components/VitrazhPage";

export const metadata = {
  title: "Вітражні вікна — елегантність і стиль для вашого дому | Вітраж",
  description:
    "Вітражні вікна для дому, дверей та фасадів — поєднання краси, індивідуальності та сучасних технологій. Класичні, діамантові та кришталеві вітражі з довговічних матеріалів.",
  keywords:
    "вітражні вікна, вітражі, діамантова грань, бевель, фацет, декоративне скло, вітраж на вікна, склопакети з вітражами, вітражі для дверей, художнє скло",
  openGraph: {
    title: "Вітражні вікна — елегантність і стиль для вашого дому",
    description:
      "Обирайте вітражні вікна для створення унікального дизайну вашого будинку. Класичні, діамантові та кришталеві елементи — вишуканий декор і довговічність."}
  
};

const vitrazh = () => {
  return ( <><VitrazhPage></VitrazhPage></> );
}
 
export default vitrazh;