import b from "@/app/assets/images/bg.jpg";

const faqs = [
  {
    question: "Чи буде утворюватися конденсат на пластикових вікнах?",
    answer:
      "В основному ця проблема стосується вікон на кухні, приміщення зачату невелике, а випаровування, при приготуванні їжі - інтенсивне. Виникнення конденсату на вікнах, в першу чергу, залежить від роботи вентиляційної системи в приміщенні. Якщо у вас погано працює витяжка, і ви не провітрювати приміщення, то на самій холодній частині вікна - склі, утворюється конденсат. Уникнути цього дуже легко, потрібно частіше провітрювати, а також не закривати батарею надто широким підвіконням.",
  },
  {
    question: "Чи пожовтіють пластикові вікна з часом?",
    answer:
      "Наші пластикові вікна не пожовтіє з часом. Якість профілю, який ми використовуємо для виробництва вікон, підтверджено усіма службами по сертифікації, перевірена часом і безліччю задоволених споживачів України і Європи.",
  },
  {
    question: "Чи міняєте ви гумки ущільнювачів?",
    answer:
      "Так, ми надаємо повний спектр послуг з ремонту пластикових вікон із заміною всіх комплектуючих, в тому числі і гумового ущільнювача.",
  },
  {
    question:
      "Якщо вікна придбані не у вашій компанії, чи можете ви замінити склопакет або москітну сітку?",
    answer:
      "Так, для заміни москітної сітки або склопакета вам необхідно викликати нашого фахівця.",
  },
  {
    question: "Як правильно підготувати приміщення до монтажу вікон?",
    answer:
      "Перед доставкою: Звільніть прохід від дверей до вікна (при необхідності розчистити простір в коридорі) і приберіть тварин, для того, щоб вантажникам було зручно заносити конструкції. Перед монтажем: • Зніміть штори і приберіть все з підвіконня. • Розчистити простір біля вікна (не менше 1.5 метрів від отвору). • Подбайте про збереження підлогового покриття, якщо це необхідно. Найкраще - накрити підлогу картоном. • Обговоріть з менеджером необхідність винесення сміття і демонтованих конструкцій з майданчика. Майте на увазі, ця послуга платна.",
  },
  {
    question: "Чи можлива установка підвіконня вже після установки вікна?",
    answer: "Чи можна зберегти старий підвіконня при установці вікон пвх? Можна встановити підвіконня після установки вікна, можна зберегти старий підвіконня. Можливі будь-які варіанти. Обговорити їх необхідно з фахівцем по виміру, під час його візиту до вас.",
  },
  {
    question: "Як відбувається демонтаж старих вікон?",
    answer:
      "Під час демонтажних робіт з петель знімаються віконні стулки, а потім з отвору витягується рама. Після цього отвір ретельно зачищається від решти елементів кріплення старого вікна. Встановивши нові вікна, монтажники зберуть і винесуть все сміття на сходову клітку. Якщо замовник скористався такими додатковими послугами як «вивезення сміття зі сходової клітки» і «монтаж зі збереженням старих вікон», - це так само зроблять наші співробітники.",
  },
  {
    question:
      "Чи можна в однокамерний склопакет або теплопакет зробити вітраж?",
    answer: "Ні, оскільки технологія виготовлення вітражів увазі наклеювання вітражних елементів на скло з обох сторін, потім це скло встановлюється всередину двокамерного склопакета.",
  },
  {
    question: "Який склопакет в умовах Києва буде оптимальним?",
    answer:
      "В умовах столиці по співвідношенню ціна-якість є двокамерний склопакет (три скла) товщиною не менше 32 мм.",
  },
  {
    question: "Який розмір передоплати і чим вона зумовлюється?",
    answer:
      "Передоплата становить 80% від всієї суми замовлення. Решта 20% замовник оплачує в день доставки і підписання сторонами Акту прийому-передачі конструкцій. Виготовлення пластикових вікон - це складна виробнича задача, при рішенні якої виробник і замовник повинні бути впевнені в професіоналізмі і надійності один одного. Засоби, запитувані до початку виготовлення віконних конструкцій, по суті, є витратами, які необхідні для початку виробництва вікон (вартість профілю, склопакетів, фурнітури і т. Д.) І є гарантією платоспроможності клієнта.",
  },
  {
    question: "Чи правда, що зимовий монтаж надійний і якісний?",
    answer:
      "Зимовий період - саме час для монтажу вікон! У зимовий період фахівцям з монтажу набагато легше виявити місця «поддуванія» при установці вікон, що значно скорочує час на їх усунення. Зимовий монтаж проводиться з використанням спеціальної професійної зимової піни-герметика, яка чудово застигає при температурі на вулиці до -12 градусів.",
  },
  {
    question: "Чи можна встановити однокамерний склопакет в квартиру?",
    answer:
      "Безумовно, технічно це можливо, але ми настійно рекомендуємо для скління житлових приміщень вибирати двокамерний склопакет. Буде тепліше і тихіше.",
  },
  {
    question: "Що краще - теплопакет чи склопакет? У чому відмінності?",
    answer:
      "Теплопакет з багатофункціональним склом - це вдосконалений вигляд склопакета. За всіма показниками однокамерний теплопакет перевершує двокамерний склопакет. термін гарантії на мультифункціональний скло 20 років, проти 5-ти на звичайне скло. теплопакет зберігає тепло взимку і прохолоду влітку.",
  },
  {
    question: "Які існують кольори дистанційних рамок?",
    answer: "Ми використовуємо дистанційні рамки для теплопакет світло-сірого кольору.",
  },
  {
    question:
      "Чи можуть монтажники за 200 грн. винести все сміття до баків на вулиці?",
    answer: "Ні, в законі «Про охорону навколишнього середовища» чітко прописано, 'то будівельне сміття заборонено викидати разом з побутовими відходами, він повинен вивозитися окремо спеціалізованими технічними засобами на полігони для подальшої утилізації. Наші фахівці здійснюють винесення сміття на сходову площадку. Для зручності наших клієнтів ми надаємо послугу з вивезення сміття, ви можете замовити її додатково при замовленні вироби.",
  },
];

const FAQ = () => {
  return (
    <>
      <section className="relative h-[600px] flex items-center justify-center bg-black overflow-hidden">
        <div
          className="absolute inset-0 bg-cover bg-center opacity-40"
          style={{
            backgroundImage: `url(${b.src})`,
          }}
        />
        <h1 className="relative text-white text-4xl font-bold z-10">FAQ</h1>
      </section>

      <section className="max-w-5xl mx-auto py-16 px-4">
        <div className="space-y-4">
          {faqs.map((faq, index) => (
            <details key={index} className="rounded-[20px] p-4 bg-[#F8F7F0]">
              <summary className="cursor-pointer font-medium text-lg ">
                {faq.question}
              </summary>
              <p className="mt-2 text-gray-700">{faq.answer}</p>
            </details>
          ))}
        </div>
      </section>
    </>
  );
};

export default FAQ;
